import "./404.scss";

const Element404 = () => {
  return (
    <>
      <div className="Element404">
        <div className="container">
          <div className="Element404Wrapper">
            <span className="Element404Number">404</span>
            <div className="Element404WrapperInner">
              <div className="Element404Img">
                <svg
                  width="74"
                  height="65"
                  viewBox="0 0 74 65"
                  fill="none"
                  xmlns="http://www.w3.org/2000/svg"
                >
                  <path
                    d="M73.578 60.2379L39.6992 1.55834C38.4998 -0.519445 35.5005 -0.519445 34.3007 1.55834L0.422287 60.2379C-0.777467 62.3157 0.722045 64.9131 3.12126 64.9131H70.8784C73.2778 64.9131 74.7773 62.3158 73.578 60.2379ZM40.0402 56.6852C40.0402 57.0725 38.679 57.3866 37.0003 57.3866C35.321 57.3866 33.9598 57.0725 33.9598 56.6852V51.8208C33.9598 51.4335 35.321 51.1194 37.0003 51.1194C38.679 51.1194 40.0402 51.4336 40.0402 51.8208V56.6852ZM39.5335 45.3357C39.5346 45.3502 39.543 45.3639 39.543 45.3791C39.543 46.0069 38.4042 46.516 37.0001 46.516C35.5951 46.516 34.457 46.0069 34.457 45.3791C34.457 45.3643 34.465 45.3505 34.4665 45.3357L32.8859 25.0291C32.8859 24.4012 34.7278 23.8922 37 23.8922C39.2722 23.8922 41.1138 24.4012 41.1138 25.0291L39.5335 45.3357Z"
                    fill="#222222"
                  />
                </svg>
              </div>
              <h1 className="Element404Header">Страница не найдена</h1>
              <div className="Element404Text">
                К сожалению, запрашиваемая страница не существует или была
                удалена. Вернитесь на главную или воспользуйтесь меню навигации.
              </div>
              <a href="/" className="mainBtn">
                На главную
              </a>
            </div>
          </div>
        </div>
      </div>
    </>
  );
};

export default Element404;
